### 2.3 데이터 입출력

In [2]:
import numpy as np 
import pandas as pd

- %%writefile 매직 명령

In [10]:
%%writefile data/sample1.csv
c1,c2,c3
1,1.11,one
2,2.22,two
3,3.33,three

Overwriting data/sample1.csv

- CSV(Comma Separated Values)

In [12]:
df1= pd.read_csv('data/sample1.csv')
df1

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [13]:
df1.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [14]:
%%writefile data/sample2.csv
1,1.11,one
2,2.22,two
3,3.33,three

Writing data/sample2.csv

In [16]:
df2 = pd.read_csv('data/sample2.csv', header=None)
df2

   0     1      2
0  1  1.11    one
1  2  2.22    two
2  3  3.33  three

In [17]:
df2 = pd.read_csv('data/sample2.csv', names=['c1','c2','c3'])   # 컬럼명 지정
df2

   c1    c2     c3
0   1  1.11    one
1   2  2.22    two
2   3  3.33  three

In [19]:
df1 = pd.read_csv('data/sample1.csv', index_col='c1')   # index column 지정
df1

      c2     c3
c1
1   1.11    one
2   2.22    two
3   3.33  three

- tsv(tab separated values)

In [20]:
%%writefile data/sample3.tsv
c1  c2  c3  c4
0.179181    -1.538472   1.347553    0.43381
1.024209    0.087307    -1.281997      0.49265
0.417899    -2.002308   0.255245     -1.10515

Writing data/sample3.tsv

In [22]:
df3 = pd.read_csv('data/sample3.tsv', sep='\s+')    #파일에는 탭 문자대신에 공백이 여러개 들어가 있음
df3

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [24]:
df3 = pd.read_table('data/sample3.tsv', sep='\s+')
df3

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

- 여러줄의 헤더

In [25]:
%%writefile data/sample4.csv
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing data/sample4.csv

In [26]:
df4 = pd.read_csv('data/sample4.csv', skiprows=2)
df4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

- 인코딩

In [11]:
#df9.to_csv('data/서울시 자치구 연도별 방범용 CCTV 운영 현황_230630기준.csv', encoding='EUC-KR', index=False)
#pd.read_csv('data/서울시 자치구 연도별 방범용 CCTV 운영 현황_230630기준.csv')

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xc1 in position 2: invalid start byte

In [4]:
df5 = pd.read_csv('data/경기도 성남시_인구및세대_현황_20230731.csv', encoding='EUC-KR')
df5.head(3)

,구별,동,인구수_계,인구수_남,인구수_여,19세 이상_계,19세 이상_남,19세 이상_여,65세 이상_계,65세 이상_남자,65세 이상_여자,세대수,재외국민,데이터기준일자
0,수정구,신흥1동,12955,6832,6123,12012,6350,5662,2790,1182,1608,7854,15,2023-07-31
1,수정구,신흥2동,19843,9637,10206,16890,8158,8732,3146,1445,1701,7628,33,2023-07-31
2,수정구,신흥3동,11034,5905,5129,10215,5489,4726,2304,1060,1244,6490,9,2023-07-31

- CSV 파일 출력

In [29]:
# index까지 저장되어, 추후 파일을 읽을 때 Unnamed: 0 컬럼이 생긴다.
df4.to_csv('data/sample6.csv')
pd.read_csv('data/sample6.csv')

   Unnamed: 0  c1    c2      c3
0           0   1  1.11     one
1           1   2  2.22     two
2           2   3  3.33   three

In [30]:
df4.to_csv('data/sample7.csv', index=False)
pd.read_csv('data/sample7.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [31]:
df4.to_csv('data/sample8.csv', index=False, sep='|')
pd.read_csv('data/sample8.csv', sep='|')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

- 인터넷 파일도 읽을 수 있음

In [32]:
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S